# FabricationServiceSettings Class

---
C#Visual BasicVisual C++
Revit 2024 API
---
FabricationServiceSettings Class
Members See Also
---
Represents the settings related to the fabrication services.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2024
# Syntax
C#
---
```text
public class FabricationServiceSettings : Element
```

Visual Basic
---
```text
Public Class FabricationServiceSettings _
	Inherits Element
```

Visual C++
---
```text
public ref class FabricationServiceSettings : public Element
```

# Inheritance Hierarchy
System..::..Object Autodesk.Revit.DB..::..Element Autodesk.Revit.DB..::..FabricationServiceSettings
# See Also
FabricationServiceSettings Members
Autodesk.Revit.DB Namespace